# custom_yolo.yaml
# RoadVision — Custom Darknet Backbone + YOLOv8 Neck & Head

task: detect
nc: 11
depth_multiple: 1.0
width_multiple: 1.0

#  BACKBONE (custom Darknet-inspired CNN)
backbone:
  # [from, repeats, module, args]

  # Stem: 512x512 → 256x256, 3→32 channels
  - [-1, 1, Conv, [32, 3, 2]]           # 0

  # Stage 1: 256x256 → 128x128, 32→64 channels
  - [-1, 1, Conv, [64, 3, 2]]           # 1
  - [-1, 1, C2f,  [64, True]]           # 2

  # Stage 2: 128x128 → 64x64, 64→128 channels (P3)
  - [-1, 1, Conv, [128, 3, 2]]          # 3
  - [-1, 2, C2f,  [128, True]]          # 4

  # Stage 3: 64x64 → 32x32, 128→256 channels (P4)
  - [-1, 1, Conv, [256, 3, 2]]          # 5
  - [-1, 4, C2f,  [256, True]]          # 6

  # Stage 4: 32x32 → 16x16, 256→512 channels (P5)
  - [-1, 1, Conv, [512, 3, 2]]          # 7
  - [-1, 2, C2f,  [512, True]]          # 8

  # SPPF: multi-scale context pooling
  - [-1, 1, SPPF, [512, 5]]             # 9

#  HEAD (YOLOv8 FPN neck + detection head)
head:
  # Top-down path
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 10
  - [[-1, 6], 1, Concat, [1]]                      # 11
  - [-1, 1, C2f, [256]]                            # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 13
  - [[-1, 4], 1, Concat, [1]]                      # 14
  - [-1, 1, C2f, [128]]                            # 15

  # Bottom-up path
  - [-1, 1, Conv, [128, 3, 2]]                     # 16
  - [[-1, 12], 1, Concat, [1]]                     # 17
  - [-1, 1, C2f, [256]]                            # 18
  - [-1, 1, Conv, [256, 3, 2]]                     # 19
  - [[-1, 9], 1, Concat, [1]]                      # 20
  - [-1, 1, C2f, [512]]                            # 21

  # Detection head — all 3 scales
  - [[15, 18, 21], 1, Detect, [nc]]                # 22
